GopalSaraf/Practicals/PSDL/include/proc/pic18f87j72.inc
// Register: PORTF
#define PORTF PORTF
PORTF                                    equ 0F85h
// bitfield definitions
PORTF_RF1_POSN                           equ 0001h
PORTF_RF1_POSITION                       equ 0001h
PORTF_RF1_SIZE                           equ 0001h
PORTF_RF1_LENGTH                         equ 0001h
PORTF_RF1_MASK                           equ 0002h
PORTF_RF2_POSN                           equ 0002h
PORTF_RF2_POSITION                       equ 0002h
PORTF_RF2_SIZE                           equ 0001h
PORTF_RF2_LENGTH                         equ 0001h
PORTF_RF2_MASK                           equ 0004h
PORTF_RF3_POSN                           equ 0003h
PORTF_RF3_POSITION                       equ 0003h
PORTF_RF3_SIZE                           equ 0001h
PORTF_RF3_LENGTH                         equ 0001h
PORTF_RF3_MASK                           equ 0008h
PORTF_RF4_POSN                           equ 0004h
PORTF_RF4_POSITION                       equ 0004h
PORTF_RF4_SIZE                           equ 0001h
PORTF_RF4_LENGTH                         equ 0001h
PORTF_RF4_MASK                           equ 0010h
PORTF_RF5_POSN                           equ 0005h
PORTF_RF5_POSITION                       equ 0005h
PORTF_RF5_SIZE                           equ 0001h
PORTF_RF5_LENGTH                         equ 0001h
PORTF_RF5_MASK                           equ 0020h
PORTF_RF6_POSN                           equ 0006h
PORTF_RF6_POSITION                       equ 0006h
PORTF_RF6_SIZE                           equ 0001h
PORTF_RF6_LENGTH                         equ 0001h
PORTF_RF6_MASK                           equ 0040h
PORTF_RF7_POSN                           equ 0007h
PORTF_RF7_POSITION                       equ 0007h
PORTF_RF7_SIZE                           equ 0001h
PORTF_RF7_LENGTH                         equ 0001h
PORTF_RF7_MASK                           equ 0080h
PORTF_AN6_POSN                           equ 0001h
PORTF_AN6_POSITION                       equ 0001h
PORTF_AN6_SIZE                           equ 0001h
PORTF_AN6_LENGTH                         equ 0001h
PORTF_AN6_MASK                           equ 0002h
PORTF_AN7_POSN                           equ 0002h
PORTF_AN7_POSITION                       equ 0002h
PORTF_AN7_SIZE                           equ 0001h
PORTF_AN7_LENGTH                         equ 0001h
PORTF_AN7_MASK                           equ 0004h
PORTF_AN8_POSN                           equ 0003h
PORTF_AN8_POSITION                       equ 0003h
PORTF_AN8_SIZE                           equ 0001h
PORTF_AN8_LENGTH                         equ 0001h
PORTF_AN8_MASK                           equ 0008h
PORTF_AN9_POSN                           equ 0004h
PORTF_AN9_POSITION                       equ 0004h
PORTF_AN9_SIZE                           equ 0001h
PORTF_AN9_LENGTH                         equ 0001h
PORTF_AN9_MASK                           equ 0010h
PORTF_AN10_POSN                          equ 0005h
PORTF_AN10_POSITION                      equ 0005h
PORTF_AN10_SIZE                          equ 0001h
PORTF_AN10_LENGTH                        equ 0001h
PORTF_AN10_MASK                          equ 0020h
PORTF_AN11_POSN                          equ 0006h
PORTF_AN11_POSITION                      equ 0006h
PORTF_AN11_SIZE                          equ 0001h
PORTF_AN11_LENGTH                        equ 0001h
PORTF_AN11_MASK                          equ 0040h
PORTF_AN5_POSN                           equ 0007h
PORTF_AN5_POSITION                       equ 0007h
PORTF_AN5_SIZE                           equ 0001h
PORTF_AN5_LENGTH                         equ 0001h
PORTF_AN5_MASK                           equ 0080h
PORTF_C2OUT_POSN                         equ 0001h
PORTF_C2OUT_POSITION                     equ 0001h
PORTF_C2OUT_SIZE                         equ 0001h
PORTF_C2OUT_LENGTH                       equ 0001h
PORTF_C2OUT_MASK                         equ 0002h
PORTF_C1OUT_POSN                         equ 0002h
PORTF_C1OUT_POSITION                     equ 0002h
PORTF_C1OUT_SIZE                         equ 0001h
PORTF_C1OUT_LENGTH                       equ 0001h
PORTF_C1OUT_MASK                         equ 0004h
PORTF_C2INB_POSN                         equ 0003h
PORTF_C2INB_POSITION                     equ 0003h
PORTF_C2INB_SIZE                         equ 0001h
PORTF_C2INB_LENGTH                       equ 0001h
PORTF_C2INB_MASK                         equ 0008h
PORTF_C2INA_POSN                         equ 0004h
PORTF_C2INA_POSITION                     equ 0004h
PORTF_C2INA_SIZE                         equ 0001h
PORTF_C2INA_LENGTH                       equ 0001h
PORTF_C2INA_MASK                         equ 0010h
PORTF_C1INB_POSN                         equ 0005h
PORTF_C1INB_POSITION                     equ 0005h
PORTF_C1INB_SIZE                         equ 0001h
PORTF_C1INB_LENGTH                       equ 0001h
PORTF_C1INB_MASK                         equ 0020h
PORTF_C1INA_POSN                         equ 0006h
PORTF_C1INA_POSITION                     equ 0006h
PORTF_C1INA_SIZE                         equ 0001h
PORTF_C1INA_LENGTH                       equ 0001h
PORTF_C1INA_MASK                         equ 0040h
PORTF_SS1_POSN                           equ 0007h
PORTF_SS1_POSITION                       equ 0007h
PORTF_SS1_SIZE                           equ 0001h
PORTF_SS1_LENGTH                         equ 0001h
PORTF_SS1_MASK                           equ 0080h
PORTF_SEG19_POSN                         equ 0001h
PORTF_SEG19_POSITION                     equ 0001h
PORTF_SEG19_SIZE                         equ 0001h
PORTF_SEG19_LENGTH                       equ 0001h
PORTF_SEG19_MASK                         equ 0002h
PORTF_SEG20_POSN                         equ 0002h
PORTF_SEG20_POSITION                     equ 0002h
PORTF_SEG20_SIZE                         equ 0001h
PORTF_SEG20_LENGTH                       equ 0001h
PORTF_SEG20_MASK                         equ 0004h
PORTF_SEG21_POSN                         equ 0003h
PORTF_SEG21_POSITION                     equ 0003h
PORTF_SEG21_SIZE                         equ 0001h
PORTF_SEG21_LENGTH                       equ 0001h
PORTF_SEG21_MASK                         equ 0008h
PORTF_SEG22_POSN                         equ 0004h
PORTF_SEG22_POSITION                     equ 0004h
PORTF_SEG22_SIZE                         equ 0001h
PORTF_SEG22_LENGTH                       equ 0001h
PORTF_SEG22_MASK                         equ 0010h
PORTF_SEG23_POSN                         equ 0005h
PORTF_SEG23_POSITION                     equ 0005h
PORTF_SEG23_SIZE                         equ 0001h
PORTF_SEG23_LENGTH                       equ 0001h
PORTF_SEG23_MASK                         equ 0020h
PORTF_SEG24_POSN                         equ 0006h
PORTF_SEG24_POSITION                     equ 0006h
PORTF_SEG24_SIZE                         equ 0001h
PORTF_SEG24_LENGTH                       equ 0001h
PORTF_SEG24_MASK                         equ 0040h
PORTF_SEG25_POSN                         equ 0007h
PORTF_SEG25_POSITION                     equ 0007h
PORTF_SEG25_SIZE                         equ 0001h
PORTF_SEG25_LENGTH                       equ 0001h
PORTF_SEG25_MASK                         equ 0080h
PORTF_CVREF_POSN                         equ 0005h
PORTF_CVREF_POSITION                     equ 0005h
PORTF_CVREF_SIZE                         equ 0001h
PORTF_CVREF_LENGTH                       equ 0001h
PORTF_CVREF_MASK                         equ 0020h
PORTF_C2OUTF_POSN                        equ 0001h
PORTF_C2OUTF_POSITION                    equ 0001h
PORTF_C2OUTF_SIZE                        equ 0001h
PORTF_C2OUTF_LENGTH                      equ 0001h
PORTF_C2OUTF_MASK                        equ 0002h
PORTF_C1OUTF_POSN                        equ 0002h
PORTF_C1OUTF_POSITION                    equ 0002h
PORTF_C1OUTF_SIZE                        equ 0001h
PORTF_C1OUTF_LENGTH                      equ 0001h
PORTF_C1OUTF_MASK                        equ 0004h

// Register: PORTG
#define PORTG PORTG
PORTG                                    equ 0F86h
// bitfield definitions
PORTG_RG0_POSN                           equ 0000h
PORTG_RG0_POSITION                       equ 0000h
PORTG_RG0_SIZE                           equ 0001h
PORTG_RG0_LENGTH                         equ 0001h
PORTG_RG0_MASK                           equ 0001h
PORTG_RG1_POSN                           equ 0001h
PORTG_RG1_POSITION                       equ 0001h
PORTG_RG1_SIZE                           equ 0001h
PORTG_RG1_LENGTH                         equ 0001h
PORTG_RG1_MASK                           equ 0002h
PORTG_RG2_POSN                           equ 0002h
PORTG_RG2_POSITION                       equ 0002h
PORTG_RG2_SIZE                           equ 0001h
PORTG_RG2_LENGTH                         equ 0001h
PORTG_RG2_MASK                           equ 0004h
PORTG_RG3_POSN                           equ 0003h
PORTG_RG3_POSITION                       equ 0003h
PORTG_RG3_SIZE                           equ 0001h
PORTG_RG3_LENGTH                         equ 0001h
PORTG_RG3_MASK                           equ 0008h
PORTG_RG4_POSN                           equ 0004h
PORTG_RG4_POSITION                       equ 0004h
PORTG_RG4_SIZE                           equ 0001h
PORTG_RG4_LENGTH                         equ 0001h
PORTG_RG4_MASK                           equ 0010h
PORTG_RJPU_POSN                          equ 0005h
PORTG_RJPU_POSITION                      equ 0005h
PORTG_RJPU_SIZE                          equ 0001h
PORTG_RJPU_LENGTH                        equ 0001h
PORTG_RJPU_MASK                          equ 0020h
PORTG_REPU_POSN                          equ 0006h
PORTG_REPU_POSITION                      equ 0006h
PORTG_REPU_SIZE                          equ 0001h
PORTG_REPU_LENGTH                        equ 0001h
PORTG_REPU_MASK                          equ 0040h
PORTG_RDPU_POSN                          equ 0007h
PORTG_RDPU_POSITION                      equ 0007h
PORTG_RDPU_SIZE                          equ 0001h
PORTG_RDPU_LENGTH                        equ 0001h
PORTG_RDPU_MASK                          equ 0080h
PORTG_LCDBIAS0_POSN                      equ 0000h
PORTG_LCDBIAS0_POSITION                  equ 0000h
PORTG_LCDBIAS0_SIZE                      equ 0001h
PORTG_LCDBIAS0_LENGTH                    equ 0001h
PORTG_LCDBIAS0_MASK                      equ 0001h
PORTG_CK2_POSN                           equ 0001h
PORTG_CK2_POSITION                       equ 0001h
PORTG_CK2_SIZE                           equ 0001h
PORTG_CK2_LENGTH                         equ 0001h
PORTG_CK2_MASK                           equ 0002h
PORTG_DT2_POSN                           equ 0002h
PORTG_DT2_POSITION                       equ 0002h
PORTG_DT2_SIZE                           equ 0001h
PORTG_DT2_LENGTH                         equ 0001h
PORTG_DT2_MASK                           equ 0004h
PORTG_VLCAP2_POSN                        equ 0003h
PORTG_VLCAP2_POSITION                    equ 0003h
PORTG_VLCAP2_SIZE                        equ 0001h
PORTG_VLCAP2_LENGTH                      equ 0001h
PORTG_VLCAP2_MASK                        equ 0008h
PORTG_SEG26_POSN                         equ 0004h
PORTG_SEG26_POSITION                     equ 0004h
PORTG_SEG26_SIZE                         equ 0001h
PORTG_SEG26_LENGTH                       equ 0001h
PORTG_SEG26_MASK                         equ 0010h
PORTG_TX2_POSN                           equ 0001h
PORTG_TX2_POSITION                       equ 0001h
PORTG_TX2_SIZE                           equ 0001h
PORTG_TX2_LENGTH                         equ 0001h
PORTG_TX2_MASK                           equ 0002h
PORTG_RX2_POSN                           equ 0002h
PORTG_RX2_POSITION                       equ 0002h
PORTG_RX2_SIZE                           equ 0001h
PORTG_RX2_LENGTH                         equ 0001h
PORTG_RX2_MASK                           equ 0004h
PORTG_RTCC_POSN                          equ 0004h
PORTG_RTCC_POSITION                      equ 0004h
PORTG_RTCC_SIZE                          equ 0001h
PORTG_RTCC_LENGTH                        equ 0001h
PORTG_RTCC_MASK                          equ 0010h
PORTG_VLCAP1_POSN                        equ 0002h
PORTG_VLCAP1_POSITION                    equ 0002h
PORTG_VLCAP1_SIZE                        equ 0001h
PORTG_VLCAP1_LENGTH                      equ 0001h
PORTG_VLCAP1_MASK                        equ 0004h
PORTG_C3OUTG_POSN                        equ 0001h
PORTG_C3OUTG_POSITION                    equ 0001h
PORTG_C3OUTG_SIZE                        equ 0001h
PORTG_C3OUTG_LENGTH                      equ 0001h
PORTG_C3OUTG_MASK                        equ 0002h
PORTG_RG5_POSN                           equ 0005h
PORTG_RG5_POSITION                       equ 0005h
PORTG_RG5_SIZE                           equ 0001h
PORTG_RG5_LENGTH                         equ 0001h
PORTG_RG5_MASK                           equ 0020h
PORTG_RG6_POSN                           equ 0006h
PORTG_RG6_POSITION                       equ 0006h
PORTG_RG6_SIZE                           equ 0001h
PORTG_RG6_LENGTH                         equ 0001h
PORTG_RG6_MASK                           equ 0040h
PORTG_RG7_POSN                           equ 0007h
PORTG_RG7_POSITION                       equ 0007h
PORTG_RG7_SIZE                           equ 0001h
PORTG_RG7_LENGTH                         equ 0001h
PORTG_RG7_MASK                           equ 0080h

